/**
 * Разработать логику работы калькулятора
 * Задача при n заданых чисел и при n-1 знаков, посчитать правильный результат выполнения всех операций
 * Важно соблюдать приоритетность выполнения операций
 */
var values = [16, 14356, 6434, 2222, 123, 434, 123, 77];
var operators = ["+", "-", "+", "*", "/", "-", "+"];
var result = 0;

/**
 ======================================
 YOUR CODE
 ======================================
 */


for (var i = 0; i < operators.length; i++) {
	
}

var sum = function (a, b) {

};

var odds = function (a, b) {

};

var mul = function (a, b) {

};

var divide = function (a, b) {

};





console.log(result);