/**
 * Разработать логику работы калькулятора
 * Задача при n заданых чисел и при n-1 знаков, посчитать правильный результат выполнения всех операций
 * Важно соблюдать приоритетность выполнения операций
 */
var values = [16, 2135657879, 2222, 123, 434, 123, 77];
var operators = ["+", "+", "*", "/", "-", "+"];
var result = 0;

/**
 ======================================
 YOUR CODE
 ======================================
 */

for (var i = 0; i < operators.length; i++) {

}

var sum = function (a, b) {

};

var minus = function (a, b) {

};




console.log(result);